IIJ-NetBSD/netbsd-src/share/man/man4/viaenv.4
.\"	$NetBSD: viaenv.4,v 1.7 2007/01/21 22:14:53 wiz Exp $
.\"
.\" Copyright (c) 2000 Johan Danielsson
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\"
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\"
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" 3. Neither the name of author nor the names of any contributors may
.\"    be used to endorse or promote products derived from this
.\"    software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.Dd November 26, 2025
.Dt VIAENV 4
.Os
.Sh NAME
.Nm viaenv
.Nd VIA Power Management component, VIA VT82C686(A/B)/VT8231 hardware monitor.
.Sh SYNOPSIS
.Cd "viaenv* at pci? dev ? function ?"
.Cd "viaenv* at viapcib?"
.Cd "viasmb* at viaenv?"
.Sh DESCRIPTION
The
.Nm
is an
.Xr envsys 4
compatible driver for the Hardware Monitor on VT82C686A/VT8231 southbridges.
.Pp
The Hardaware Monitor device has 10 sensors:
.Bl -column "Sensor" "Units" "Typical" -offset indent
.It Sy "Sensor" Ta Sy "Units" Ta Sy "Typical Use"
.It Li "TSENS1" Ta "uK" Ta "CPU temperature"
.It Li "TSENS2" Ta "uK" Ta "System temperature"
.It Li "TSENS3" Ta "uK" Ta "?"
.It Li "FAN1" Ta "RPM" Ta "CPU fan"
.It Li "FAN2" Ta "RPM" Ta "System fan"
.It Li "VSENS1" Ta "uV DC" Ta "CPU core voltage (2.0V)"
.It Li "VSENS2" Ta "uV DC" Ta "North Bridge core voltage (2.5V)"
.It Li "Vcore" Ta "uV DC" Ta "Internal core voltage (3.3V)"
.It Li "VSENS3" Ta "uV DC" Ta "+5V"
.It Li "VSENS4" Ta "uV DC" Ta "+12V"
.El
.Pp
Sensor data is updated every 1.5 seconds.
.Pp
The driver also provides access to the
.Tn VIA
Power Management component of the
.Tn VIA
VT82C596(A/B), VT82C686(A/B), VT8231, VT8233, VT8233A, VT8233C, VT8235,
VT8237(R), VT8237A, VT8237S, VT8251, VT8261, CX700, VX800, VX855, VX900 and VX11
South Bridges and Media System Processors.
Power Management Unit is currently used only to attach PM Timer.
.Pp
The driver provides SMBus host interface for the VT82C596(A/B), VT82C686(A/B),
and VT8231 southrbridges, which can be used with the iic(4) framework.
Newer southbridges provides this functionality through the viapcib(4) driver.
.Pp
.Sh SEE ALSO
.Xr iic 4 ,
.Xr envsys 4 ,
.Xr envstat 8 ,
.Xr viapcib 4 ,
.Xr viasmb 4
.Sh HISTORY
The
.Nm
device appeared in
.Nx 1.5 .
.Sh BUGS
Interrupt support is unimplemented, as is support for setting values.
.Sh Notes
PM Timer is also attached through acpi(4), so the driver is disabled by default
for later southbridges.
The driver is currently intended mainly to provide Hardware Monitor and SMBus
support on the VT82C596(A/B), VT82C686(A/B), and VT8231 southbridges.